In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os

In [63]:
?pd.crosstab
?pd.concat

In [5]:
df = pd.DataFrame({
    "country": ['India', 'India', 'India', 'India', 'Australia', 'Australia', 'Australia', 'SA', 'SA', 'India', 'India'],
    "state" : ['MP', 'MP', 'MP', 'UP', 'NSW', 'NSW', 'Victoria', 'Gauteng', 'Western Cape', 'Delhi','UP'],
    "city": ['Indore', 'Bhopal', 'Jabalpur', 'Lucknow', 'Sydney', 'Newcastle', 'Melbourne', 'Johannesburg', 'Cape Town', 'Delhi', 'Noida'],
    "sales": [150, 200, 100, 100, 200, 250, 300, 300, 200, 100, 50]
})

In [86]:
?df.rank

In [100]:
np.arange(1,10,2)

array([1, 3, 5, 7, 9])

In [118]:
df[['sales','rank','sales2']].describe()

            sales       rank      sales2
count   11.000000  11.000000   11.000000
mean   177.272727   2.272727   88.636364
std     84.745609   1.009050   42.372804
min     50.000000   1.000000   25.000000
25%    100.000000   1.500000   50.000000
50%    200.000000   2.000000  100.000000
75%    225.000000   3.000000  112.500000
max    300.000000   4.000000  150.000000

In [119]:
df1 = df[['sales','rank','sales2']]

In [190]:
x = ['sales','sales2','rank']
dff = pd.DataFrame()
for i,j in enumerate(x):
    df2 = df1.agg({j:[sum,np.mean, len, np.std, min, max]})
    if i == 0:
        dff = df2
    else:
        dff = pd.concat([dff,df2], axis=1)
#df1.agg({'sales':[sum,np.mean, len, np.std, min, max], 'sales2':np.mean})

In [191]:
dff

            sales      sales2       rank
sum   1950.000000  975.000000  25.000000
mean   177.272727   88.636364   2.272727
len     11.000000   11.000000  11.000000
std     84.745609   42.372804   1.009050
min     50.000000   25.000000   1.000000
max    300.000000  150.000000   4.000000

In [250]:
dfx = df[['country','city','sales']]
dfx

      country          city  sales
0       India        Indore    150
1       India        Bhopal    200
2       India      Jabalpur    100
3       India       Lucknow    100
4   Australia        Sydney    200
5   Australia     Newcastle    250
6   Australia     Melbourne    300
7          SA  Johannesburg    300
8          SA     Cape Town    200
9       India         Delhi    100
10      India         Noida     50

In [253]:
dfy = dfx.pivot_table(index='country',columns='city',values='sales').reset_index()

In [258]:
dfy.melt(id_vars='country',value_vars=['Bhopal', 'Cape Town', 'Delhi', 'Indore', 'Jabalpur','Johannesburg', 'Lucknow', 
    'Melbourne', 'Newcastle', 'Noida', 'Sydney'], var_name='city',value_name='sales').dropna()

      country          city  sales
1       India        Bhopal  200.0
5          SA     Cape Town  200.0
7       India         Delhi  100.0
10      India        Indore  150.0
13      India      Jabalpur  100.0
17         SA  Johannesburg  300.0
19      India       Lucknow  100.0
21  Australia     Melbourne  300.0
24  Australia     Newcastle  250.0
28      India         Noida   50.0
30  Australia        Sydney  200.0

In [256]:
dfy.columns

Index(['country', 'Bhopal', 'Cape Town', 'Delhi', 'Indore', 'Jabalpur',
       'Johannesburg', 'Lucknow', 'Melbourne', 'Newcastle', 'Noida', 'Sydney'],
      dtype='object', name='city')

In [260]:
y = df.pop('test')

In [263]:
df.values

array([['India', 'MP', 'Indore', 150, 2.0, 75.0],
       ['India', 'MP', 'Bhopal', 200, 1.0, 100.0],
       ['India', 'MP', 'Jabalpur', 100, 3.0, 50.0],
       ['India', 'UP', 'Lucknow', 100, 3.0, 50.0],
       ['Australia', 'NSW', 'Sydney', 200, 3.0, 100.0],
       ['Australia', 'NSW', 'Newcastle', 250, 2.0, 125.0],
       ['Australia', 'Victoria', 'Melbourne', 300, 1.0, 150.0],
       ['SA', 'Gauteng', 'Johannesburg', 300, 1.0, 150.0],
       ['SA', 'Western Cape', 'Cape Town', 200, 2.0, 100.0],
       ['India', 'Delhi', 'Delhi', 100, 3.0, 50.0],
       ['India', 'UP', 'Noida', 50, 4.0, 25.0]], dtype=object)

In [264]:
dict(a=5,b=6)

{'a': 5, 'b': 6}

In [265]:
round(6.5)

6

In [266]:
round(7.5)

8

In [8]:
df

      country         state          city  sales
0       India            MP        Indore    150
1       India            MP        Bhopal    200
2       India            MP      Jabalpur    100
3       India            UP       Lucknow    100
4   Australia           NSW        Sydney    200
5   Australia           NSW     Newcastle    250
6   Australia      Victoria     Melbourne    300
7          SA       Gauteng  Johannesburg    300
8          SA  Western Cape     Cape Town    200
9       India         Delhi         Delhi    100
10      India            UP         Noida     50

In [12]:
df.groupby(['country']).filter(lambda x: x['sales'].mean() > 200)

     country         state          city  sales
4  Australia           NSW        Sydney    200
5  Australia           NSW     Newcastle    250
6  Australia      Victoria     Melbourne    300
7         SA       Gauteng  Johannesburg    300
8         SA  Western Cape     Cape Town    200

In [13]:
a = pd.DataFrame({"name": ['Abhishek', 'Shrasti', 'Anvit']
                  ,"physics": [99, np.NaN, 95]
                  ,"maths": [100, 60, 99] })

In [24]:
a[a.isnull().any(axis=1)]

      name  physics  maths
1  Shrasti      NaN     60

In [64]:
b = pd.DataFrame(a.isnull().sum()).reset_index()
b.columns = ['index','value']
b[b.value > 0]

     index  value
1  physics      1

In [69]:
a[a.isnull().any(axis=1)]

      name  physics  maths
1  Shrasti      NaN     60

In [81]:
a.isnull().sum() > 0

name       False
physics     True
maths      False
dtype: bool

In [73]:
?pd.DataFrame.sort_values

In [84]:
a.columns[a.isnull().sum() > 0]

Index(['physics'], dtype='object')

In [2]:
import pandas as pd

data = {
    'movie_name': ['Dangal', 'PK', 'Bajrangi Bhaijaan', 'Sultan', 'Padmaavat', 'Sanju', 'Tiger Zinda Hai', 'Dhoom 3', 'War', '3 Idiots'],
    'director_name': ['Nitesh Tiwari', 'Rajkumar Hirani', 'Kabir Khan', 'Ali Abbas Zafar', 'Sanjay Leela Bhansali', 'Rajkumar Hirani', 'Ali Abbas Zafar', 'Vijay Krishna Acharya', 'Siddharth Anand', 'Rajkumar Hirani'],
    'producer_name': ['Aamir Khan', 'Vidhu Vinod Chopra', 'Salman Khan', 'Aditya Chopra', 'Sanjay Leela Bhansali', 'Rajkumar Hirani', 'Aditya Chopra', 'Aditya Chopra', 'Aditya Chopra', 'Vidhu Vinod Chopra'],
    'lead_actor_name': ['Aamir Khan', 'Aamir Khan', 'Salman Khan', 'Salman Khan', 'Deepika Padukone', 'Ranbir Kapoor', 'Salman Khan', 'Aamir Khan', 'Hrithik Roshan', 'Aamir Khan']
}

df = pd.DataFrame(data)
df

,movie_name,director_name,producer_name,lead_actor_name
0,Dangal,Nitesh Tiwari,Aamir Khan,Aamir Khan
1,PK,Rajkumar Hirani,Vidhu Vinod Chopra,Aamir Khan
2,Bajrangi Bhaijaan,Kabir Khan,Salman Khan,Salman Khan
3,Sultan,Ali Abbas Zafar,Aditya Chopra,Salman Khan
4,Padmaavat,Sanjay Leela Bhansali,Sanjay Leela Bhansali,Deepika Padukone
5,Sanju,Rajkumar Hirani,Rajkumar Hirani,Ranbir Kapoor
6,Tiger Zinda Hai,Ali Abbas Zafar,Aditya Chopra,Salman Khan
7,Dhoom 3,Vijay Krishna Acharya,Aditya Chopra,Aamir Khan
8,War,Siddharth Anand,Aditya Chopra,Hrithik Roshan
9,3 Idiots,Rajkumar Hirani,Vidhu Vinod Chopra,Aamir Khan

In [7]:
df.columns

Index(['country', 'state', 'city', 'sales'], dtype='object')

In [14]:
def test(x: pd.DataFrame) -> pd.DataFrame:
    y = x['country']
    return y

In [15]:
test(df)

0         India
1         India
2         India
3         India
4     Australia
5     Australia
6     Australia
7            SA
8            SA
9         India
10        India
Name: country, dtype: object

In [16]:
os.getcwd()

'C:\\Users\\abhbansa5\\OneDrive - Publicis Groupe\\Documents\\GitHub\\python-programming'

In [78]:
a = pd.read_csv("C:\\Users\\abhbansa5\\Downloads\\accident.csv")

In [79]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Age              200 non-null    int64
 1   Gender           199 non-null    object
 2   Speed_of_Impact  197 non-null    float64
 3   Helmet_Used      200 non-null    object
 4   Seatbelt_Used    200 non-null    object
 5   Survived         200 non-null    int64
dtypes: float64(1), int64(2), object(3)
memory usage: 9.5+ KB

In [80]:
#Rows with null values
a[a.isna().any(axis=1)]

    Age  Gender  Speed_of_Impact Helmet_Used Seatbelt_Used  Survived
15   41  Female              NaN          No            No         0
19   41    Male              NaN         Yes            No         1
29   42    Male              NaN         Yes            No         0
30   66     NaN             72.0          No           Yes         0

In [81]:
#Columns with null values
a.isna().sum().sort_values(ascending=False)

Speed_of_Impact    3
Gender             1
Age                0
Helmet_Used        0
Seatbelt_Used      0
Survived           0
dtype: int64

In [82]:
#Drop rows with na values
a = a.dropna()

In [83]:
a[['Survived']].value_counts()

Survived
1           100
0            96
dtype: int64

In [84]:
a.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 196 entries, 0 to 199
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Age              196 non-null    int64
 1   Gender           196 non-null    object
 2   Speed_of_Impact  196 non-null    float64
 3   Helmet_Used      196 non-null    object
 4   Seatbelt_Used    196 non-null    object
 5   Survived         196 non-null    int64
dtypes: float64(1), int64(2), object(3)
memory usage: 10.7+ KB

In [61]:
#a[a.select_dtypes(['object']).columns] = a.select_dtypes(['object']).apply(lambda x: x.astype('category'))
#OR
#a[['Gender','Helmet_Used','Seatbelt_Used']] = a[['Gender','Helmet_Used','Seatbelt_Used']].astype('category')

C:\Users\abhbansa5\AppData\Local\Temp\ipykernel_19264\3930171559.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  a[a.select_dtypes(['object']).columns] = a.select_dtypes(['object']).apply(lambda x: x.astype('category'))

In [71]:
#a.Gender.cat.categories

Index(['Female', 'Male'], dtype='object')

In [85]:
from sklearn.preprocessing import OrdinalEncoder

In [86]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(a.loc[:,a.columns != "Survived"], a.Survived, train_size=0.8, stratify=a.Survived)

In [87]:
X_train.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 156 entries, 46 to 75
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Age              156 non-null    int64
 1   Gender           156 non-null    object
 2   Speed_of_Impact  156 non-null    float64
 3   Helmet_Used      156 non-null    object
 4   Seatbelt_Used    156 non-null    object
dtypes: float64(1), int64(1), object(3)
memory usage: 7.3+ KB

In [88]:
encoder = OrdinalEncoder()
encoder.fit(X_train[["Gender","Helmet_Used","Seatbelt_Used"]])
X_train_encoded = encoder.transform(X_train[["Gender","Helmet_Used","Seatbelt_Used"]])
X_test_encoded = encoder.transform(X_test[["Gender","Helmet_Used","Seatbelt_Used"]])

In [116]:
X_train_new = pd.concat([X_train.reset_index(drop=True), pd.DataFrame(X_train_encoded, columns=['gener_enc','helmet_enc','seatbelt_enc'])], axis=1)

In [134]:
selected_cols = ['Age','Speed_of_Impact','gener_enc','helmet_enc','seatbelt_enc']
X_train_new = X_train_new[selected_cols]
X_train_new

     Age  Speed_of_Impact  gener_enc  helmet_enc  seatbelt_enc
0     56             86.0        0.0         1.0           1.0
1     51             84.0        0.0         1.0           1.0
2     56             82.0        0.0         0.0           1.0
3     36             83.0        0.0         1.0           0.0
4     69             97.0        0.0         1.0           1.0
..   ...              ...        ...         ...           ...
151   44             21.0        0.0         0.0           1.0
152   32             82.0        1.0         0.0           1.0
153   44             88.0        0.0         1.0           1.0
154   54             37.0        1.0         0.0           1.0
155   43             64.0        0.0         1.0           0.0

[156 rows x 5 columns]

In [136]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import cross_validate
import numpy as np

# Initialize with whatever parameters you want to
clf = RandomForestClassifier()

# 10-Fold Cross validation
#np.mean(cross_val_score(clf, X_train_new, y_train, cv=10))
output = cross_validate(clf, X_train_new, y_train, cv=2, scoring = 'accuracy', return_estimator =True)

In [138]:
for idx,estimator in enumerate(output['estimator']):
    print("Features sorted by their score for estimator {}:".format(idx))
    feature_importances = pd.DataFrame(estimator.feature_importances_,
                                       index = X_train_new.columns,
                                        columns=['importance']).sort_values('importance', ascending=False)
    print(feature_importances)

Features sorted by their score for estimator 0:
                 importance
Speed_of_Impact    0.451326
Age                0.389148
seatbelt_enc       0.059406
helmet_enc         0.057926
gener_enc          0.042194
Features sorted by their score for estimator 1:
                 importance
Age                0.421395
Speed_of_Impact    0.351728
seatbelt_enc       0.090183
helmet_enc         0.075882
gener_enc          0.060813

In [91]:
df1 = pd.DataFrame({'A':[10,20,30],'B':[20,30,40]})
df2 = pd.DataFrame({'C':[10,20,30],'D':[20,30,40]})

In [102]:
pd.concat([df1,df2], axis=1)

    A   B   C   D
0  10  20  10  20
1  20  30  20  30
2  30  40  30  40

In [104]:
X_train

     Age  Gender  Speed_of_Impact Helmet_Used Seatbelt_Used
46    56  Female             86.0         Yes           Yes
77    51  Female             84.0         Yes           Yes
148   56  Female             82.0          No           Yes
8     36  Female             83.0         Yes            No
160   69  Female             97.0         Yes           Yes
..   ...     ...              ...         ...           ...
194   44  Female             21.0          No           Yes
35    32    Male             82.0          No           Yes
149   44  Female             88.0         Yes           Yes
41    54    Male             37.0          No           Yes
75    43  Female             64.0         Yes            No

[156 rows x 5 columns]

In [107]:
pd.DataFrame(X_train_encoded, columns=['gener_enc','helmet_enc','seatbelt_enc'])

     gener_enc  helmet_enc  seatbelt_enc
0          0.0         1.0           1.0
1          0.0         1.0           1.0
2          0.0         0.0           1.0
3          0.0         1.0           0.0
4          0.0         1.0           1.0
..         ...         ...           ...
151        0.0         0.0           1.0
152        1.0         0.0           1.0
153        0.0         1.0           1.0
154        1.0         0.0           1.0
155        0.0         1.0           0.0

[156 rows x 3 columns]

In [112]:
X_train_new

      Age  Speed_of_Impact  gener_enc  helmet_enc  seatbelt_enc
46   56.0             86.0        1.0         0.0           1.0
77   51.0             84.0        1.0         0.0           1.0
148  56.0             82.0        1.0         0.0           0.0
8    36.0             83.0        1.0         1.0           0.0
160  69.0             97.0        NaN         NaN           NaN
..    ...              ...        ...         ...           ...
134   NaN              NaN        1.0         1.0           1.0
138   NaN              NaN        0.0         1.0           0.0
139   NaN              NaN        1.0         1.0           0.0
152   NaN              NaN        1.0         0.0           1.0
155   NaN              NaN        0.0         1.0           0.0

[194 rows x 5 columns]

In [115]:
X_train.reset_index(drop=True)

     Age  Gender  Speed_of_Impact Helmet_Used Seatbelt_Used
0     56  Female             86.0         Yes           Yes
1     51  Female             84.0         Yes           Yes
2     56  Female             82.0          No           Yes
3     36  Female             83.0         Yes            No
4     69  Female             97.0         Yes           Yes
..   ...     ...              ...         ...           ...
151   44  Female             21.0          No           Yes
152   32    Male             82.0          No           Yes
153   44  Female             88.0         Yes           Yes
154   54    Male             37.0          No           Yes
155   43  Female             64.0         Yes            No

[156 rows x 5 columns]

In [118]:
X_train_new

     Age  Speed_of_Impact  gener_enc  helmet_enc  seatbelt_enc
0     56             86.0        0.0         1.0           1.0
1     51             84.0        0.0         1.0           1.0
2     56             82.0        0.0         0.0           1.0
3     36             83.0        0.0         1.0           0.0
4     69             97.0        0.0         1.0           1.0
..   ...              ...        ...         ...           ...
151   44             21.0        0.0         0.0           1.0
152   32             82.0        1.0         0.0           1.0
153   44             88.0        0.0         1.0           1.0
154   54             37.0        1.0         0.0           1.0
155   43             64.0        0.0         1.0           0.0

[156 rows x 5 columns]

In [145]:
from sklearn.model_selection import StratifiedKFold

In [ ]:
skf = StratifiedKFold